regions_in_federal = {'ЦЕНТРАЛЬНЫЙ ФО': 
        ['Белгородская область',
       'Брянская область', 'Владимирская область', 'Воронежская область',
       'Ивановская область', 'Тверская область', 'Калужская область',
       'Костромская область', 'Курская область', 'Липецкая область',
       'г. Москва', 'Московская область', 'Орловская область',
       'Рязанская область', 'Смоленская область', 'Тамбовская область',
       'Тульская область', 'Ярославская область'],
                    'СЕВЕРО-ЗАПАДНЫЙ ФО':
       ['Ненецкий а.о.', 'Архангельская обл.(б/а.о)',
       'Вологодская область', 'Калининградская область',
       'г. Санкт-Петербург', 'Ленинградская область',
       'Мурманская область', 'Новгородская область', 'Псковская область',
       'Республика Карелия', 'Республика Коми'], 
                      'ЮЖНЫЙ ФО':
       ['Краснодарский край', 'Астраханская область',
       'Волгоградская область', 'Ростовская область', 'Республика Адыгея',
       'Республика Калмыкия', 'Республика Крым', 'Город Cевастополь'],
                      'СЕВЕРО-КАВКАЗСКИЙ ФО': 
        ['Ставропольский край', 'Республика Ингушетия', 'Республика Дагестан',
       'Респ. Кабардино-Балкария', 'Респ. Северная Осетия',
       'Респ. Карачаево-Черкесия', 'Республика Чечня'], 
                      'ПРИВОЛЖСКИЙ ФО':
       ['Нижегородская область', 'Кировская область', 'Самарская область',
       'Оренбургская область', 'Пензенская область', 'Пермский край',
       'Саратовская область', 'Ульяновская область',
       'Республика Башкортостан', 'Республика Марий Эл',
       'Республика Мордовия', 'Республика Татарстан',
       'Республика Удмуртия', 'Республика Чувашия'], 
                      'УРАЛЬСКИЙ ФО':
       ['Ханты-Мансийский а.о.', 'Ямало-Ненецкий а.о.',
       'Курганская область', 'Свердловская область',
       'Тюменская обл.(б/а.о)', 'Челябинская область'], 
                      'СИБИРСКИЙ ФО':
       ['Алтайский край', 'Красноярский край', 'Иркутская область',
       'Кемеровская область', 'Новосибирская область', 'Омская область',
       'Томская область', 'Республика Алтай', 'Республика Тыва',
       'Республика Хакасия'], 
                      'ДАЛЬНЕВОСТОЧНЫЙ ФО': 
        ['Приморский край', 'Хабаровский край', 'Амурская область', 'Камчатский край',
       'Магаданская область', 'Сахалинская область', 'Забайкальский край',
       'Чукотский авт.округ', 'Республика Бурятия',
       'Республика Саха (Якутия)', 'Еврейская авт. обл.']}